fawkesrobotics/fawkes/src/plugins/pantilt/robotis/rx28_thread.cpp

/***************************************************************************
 *  rx28_thread.cpp - RX28 pan/tilt unit act thread
 *
 *  Created: Thu Jun 18 09:53:49 2009
 *  Copyright  2006-2011  Tim Niemueller [www.niemueller.de]
 ****************************************************************************/

/*  This program is free software; you can redistribute it and/or modify
 *  it under the terms of the GNU General Public License as published by
 *  the Free Software Foundation; either version 2 of the License, or
 *  (at your option) any later version.
 *
 *  This program is distributed in the hope that it will be useful,
 *  but WITHOUT ANY WARRANTY; without even the implied warranty of
 *  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 *  GNU Library General Public License for more details.
 *
 *  Read the full text in the LICENSE.GPL file in the doc directory.
 */

#include "rx28_thread.h"

#include "rx28.h"

#include <core/threading/mutex_locker.h>
#include <core/threading/read_write_lock.h>
#include <core/threading/scoped_rwlock.h>
#include <core/threading/wait_condition.h>
#include <interfaces/JointInterface.h>
#include <interfaces/LedInterface.h>
#include <interfaces/PanTiltInterface.h>
#include <utils/math/angle.h>

#include <cmath>
#include <cstdarg>
#include <unistd.h>

using namespace fawkes;

/** @class PanTiltRX28Thread "rx28_thread.h"
 * PanTilt act thread for RX28 PTU.
 * This thread integrates into the Fawkes main loop at the ACT_EXEC hook and
 * interacts with the controller of the RX28 PTU.
 * @author Tim Niemueller
 */

/** Constructor.
 * @param pantilt_cfg_prefix pantilt plugin configuration prefix
 * @param ptu_cfg_prefix configuration prefix specific for the PTU
 * @param ptu_name name of the PTU configuration
 */
PanTiltRX28Thread::PanTiltRX28Thread(std::string &pantilt_cfg_prefix,
                                     std::string &ptu_cfg_prefix,
                                     std::string &ptu_name)
: PanTiltActThread("PanTiltRX28Thread"),
#ifdef HAVE_TF
  TransformAspect(TransformAspect::ONLY_PUBLISHER, (std::string("PTU ") + ptu_name).c_str()),
#endif
  BlackBoardInterfaceListener("PanTiltRX28Thread(%s)", ptu_name.c_str())
{
	set_name("PanTiltRX28Thread(%s)", ptu_name.c_str());

	pantilt_cfg_prefix_ = pantilt_cfg_prefix;
	ptu_cfg_prefix_     = ptu_cfg_prefix;
	ptu_name_           = ptu_name;

	rx28_ = NULL;
}

void
PanTiltRX28Thread::init()
{
	last_pan_ = last_tilt_   = 0.f;
	float init_pan_velocity  = 0.f;
	float init_tilt_velocity = 0.f;

	// Note: due to the use of auto_ptr and RefPtr resources are automatically
	// freed on destruction, therefore no special handling is necessary in init()
	// itself!

	cfg_device_           = config->get_string((ptu_cfg_prefix_ + "device").c_str());
	cfg_read_timeout_ms_  = config->get_uint((ptu_cfg_prefix_ + "read_timeout_ms").c_str());
	cfg_disc_timeout_ms_  = config->get_uint((ptu_cfg_prefix_ + "discover_timeout_ms").c_str());
	cfg_pan_servo_id_     = config->get_uint((ptu_cfg_prefix_ + "pan_servo_id").c_str());
	cfg_tilt_servo_id_    = config->get_uint((ptu_cfg_prefix_ + "tilt_servo_id").c_str());
	cfg_pan_offset_       = deg2rad(config->get_float((ptu_cfg_prefix_ + "pan_offset").c_str()));
	cfg_tilt_offset_      = deg2rad(config->get_float((ptu_cfg_prefix_ + "tilt_offset").c_str()));
	cfg_goto_zero_start_  = config->get_bool((ptu_cfg_prefix_ + "goto_zero_start").c_str());
	cfg_turn_off_         = config->get_bool((ptu_cfg_prefix_ + "turn_off").c_str());
	cfg_cw_compl_margin_  = config->get_uint((ptu_cfg_prefix_ + "cw_compl_margin").c_str());
	cfg_ccw_compl_margin_ = config->get_uint((ptu_cfg_prefix_ + "ccw_compl_margin").c_str());
	cfg_cw_compl_slope_   = config->get_uint((ptu_cfg_prefix_ + "cw_compl_slope").c_str());
	cfg_ccw_compl_slope_  = config->get_uint((ptu_cfg_prefix_ + "ccw_compl_slope").c_str());
	cfg_pan_min_          = config->get_float((ptu_cfg_prefix_ + "pan_min").c_str());
	cfg_pan_max_          = config->get_float((ptu_cfg_prefix_ + "pan_max").c_str());
	cfg_tilt_min_         = config->get_float((ptu_cfg_prefix_ + "tilt_min").c_str());
	cfg_tilt_max_         = config->get_float((ptu_cfg_prefix_ + "tilt_max").c_str());
	cfg_pan_margin_       = config->get_float((ptu_cfg_prefix_ + "pan_margin").c_str());
	cfg_tilt_margin_      = config->get_float((ptu_cfg_prefix_ + "tilt_margin").c_str());
	cfg_pan_start_        = config->get_float((ptu_cfg_prefix_ + "pan_start").c_str());
	cfg_tilt_start_       = config->get_float((ptu_cfg_prefix_ + "tilt_start").c_str());
#ifdef HAVE_TF
	cfg_publish_transforms_ = config->get_bool((ptu_cfg_prefix_ + "publish_transforms").c_str());
#endif

#ifdef HAVE_TF
	if (cfg_publish_transforms_) {
		float pan_trans_x  = config->get_float((ptu_cfg_prefix_ + "pan_trans_x").c_str());
		float pan_trans_y  = config->get_float((ptu_cfg_prefix_ + "pan_trans_y").c_str());
		float pan_trans_z  = config->get_float((ptu_cfg_prefix_ + "pan_trans_z").c_str());
		float tilt_trans_x = config->get_float((ptu_cfg_prefix_ + "tilt_trans_x").c_str());
		float tilt_trans_y = config->get_float((ptu_cfg_prefix_ + "tilt_trans_y").c_str());
		float tilt_trans_z = config->get_float((ptu_cfg_prefix_ + "tilt_trans_z").c_str());

		std::string frame_id_prefix = std::string("") + ptu_name_;
		try {
			frame_id_prefix = config->get_string((ptu_cfg_prefix_ + "frame_id_prefix").c_str());
		} catch (Exception &e) {
		} // ignore, use default

		cfg_base_frame_ = frame_id_prefix + "/base";
		cfg_pan_link_   = frame_id_prefix + "/pan";
		cfg_tilt_link_  = frame_id_prefix + "/tilt";

		translation_pan_.setValue(pan_trans_x, pan_trans_y, pan_trans_z);
		translation_tilt_.setValue(tilt_trans_x, tilt_trans_y, tilt_trans_z);
	}
#endif

	bool pan_servo_found = false, tilt_servo_found = false;

	rx28_                        = new RobotisRX28(cfg_device_.c_str(), cfg_read_timeout_ms_);
	RobotisRX28::DeviceList devl = rx28_->discover();
	for (RobotisRX28::DeviceList::iterator i = devl.begin(); i != devl.end(); ++i) {
		if (cfg_pan_servo_id_ == *i) {
			pan_servo_found = true;
		} else if (cfg_tilt_servo_id_ == *i) {
			tilt_servo_found = true;
		} else {
			logger->log_warn(name(),
			                 "Servo %u in PTU servo chain, but neither "
			                 "configured as pan nor as tilt servo",
			                 *i);
		}
	}

	// We only want responses to be sent on explicit READ to speed up communication
	rx28_->set_status_return_level(RobotisRX28::BROADCAST_ID, RobotisRX28::SRL_RESPOND_READ);
	// set compliance values
	rx28_->set_compliance_values(RobotisRX28::BROADCAST_ID,
	                             cfg_cw_compl_margin_,
	                             cfg_cw_compl_slope_,
	                             cfg_ccw_compl_margin_,
	                             cfg_ccw_compl_slope_);
	rx28_->set_led_enabled(cfg_pan_servo_id_, false);

	if (!(pan_servo_found && tilt_servo_found)) {
		throw Exception("Pan and/or tilt servo not found: pan: %i  tilt: %i",
		                pan_servo_found,
		                tilt_servo_found);
	}

	// If you have more than one interface: catch exception and close them!
	std::string bbid = "PanTilt " + ptu_name_;
	pantilt_if_      = blackboard->open_for_writing<PanTiltInterface>(bbid.c_str());
	pantilt_if_->set_calibrated(true);
	pantilt_if_->set_min_pan(cfg_pan_min_);
	pantilt_if_->set_max_pan(cfg_pan_max_);
	pantilt_if_->set_min_tilt(cfg_tilt_min_);
	pantilt_if_->set_max_tilt(cfg_tilt_max_);
	pantilt_if_->set_pan_margin(cfg_pan_margin_);
	pantilt_if_->set_tilt_margin(cfg_tilt_margin_);
	pantilt_if_->set_max_pan_velocity(rx28_->get_max_supported_speed(cfg_pan_servo_id_));
	pantilt_if_->set_max_tilt_velocity(rx28_->get_max_supported_speed(cfg_tilt_servo_id_));
	pantilt_if_->set_pan_velocity(init_pan_velocity);
	pantilt_if_->set_tilt_velocity(init_tilt_velocity);
	pantilt_if_->write();

	led_if_ = blackboard->open_for_writing<LedInterface>(bbid.c_str());

	std::string panid = ptu_name_ + " pan";
	panjoint_if_      = blackboard->open_for_writing<JointInterface>(panid.c_str());
	panjoint_if_->set_position(last_pan_);
	panjoint_if_->set_velocity(init_pan_velocity);
	panjoint_if_->write();

	std::string tiltid = ptu_name_ + " tilt";
	tiltjoint_if_      = blackboard->open_for_writing<JointInterface>(tiltid.c_str());
	tiltjoint_if_->set_position(last_tilt_);
	tiltjoint_if_->set_velocity(init_tilt_velocity);
	tiltjoint_if_->write();

	wt_ = new WorkerThread(ptu_name_,
	                       logger,
	                       rx28_,
	                       cfg_pan_servo_id_,
	                       cfg_tilt_servo_id_,
	                       cfg_pan_min_,
	                       cfg_pan_max_,
	                       cfg_tilt_min_,
	                       cfg_tilt_max_,
	                       cfg_pan_offset_,
	                       cfg_tilt_offset_);
	wt_->set_margins(cfg_pan_margin_, cfg_tilt_margin_);
	wt_->start();
	wt_->set_enabled(true);
	if (cfg_goto_zero_start_) {
		wt_->goto_pantilt_timed(cfg_pan_start_, cfg_tilt_start_, 3.0);
	}

	bbil_add_message_interface(pantilt_if_);
	bbil_add_message_interface(panjoint_if_);
	bbil_add_message_interface(tiltjoint_if_);
	blackboard->register_listener(this);

