fawkesrobotics/fawkes/src/plugins/pantilt/robotis/rx28_thread.cpp
#ifdef USE_TIMETRACKER
	tt_.reset(new TimeTracker());
	tt_count_        = 0;
	ttc_read_sensor_ = tt_->add_class("Read Sensor");
#endif
}

bool
PanTiltRX28Thread::prepare_finalize_user()
{
	if (cfg_turn_off_) {
		logger->log_info(name(), "Moving to park position");
		wt_->goto_pantilt_timed(0, cfg_tilt_max_, 2.0);
		// we need to wait twice, because the first wakeup is likely to happen
		// before the command is actually send
		wt_->wait_for_fresh_data();
		wt_->wait_for_fresh_data();

		while (!wt_->is_final()) {
			//wt_->wakeup();
			wt_->wait_for_fresh_data();
		}
	}
	return true;
}

void
PanTiltRX28Thread::finalize()
{
	blackboard->unregister_listener(this);
	blackboard->close(pantilt_if_);
	blackboard->close(led_if_);
	blackboard->close(panjoint_if_);
	blackboard->close(tiltjoint_if_);

	wt_->cancel();
	wt_->join();
	delete wt_;

	if (cfg_turn_off_) {
		logger->log_info(name(), "Turning off PTU");
		try {
			rx28_->set_led_enabled(cfg_pan_servo_id_, false);
			rx28_->set_led_enabled(cfg_tilt_servo_id_, false);
			rx28_->set_torques_enabled(false, 2, cfg_pan_servo_id_, cfg_tilt_servo_id_);
		} catch (Exception &e) {
			logger->log_warn(name(), "Failed to turn of PTU: %s", e.what());
		}
	}

	// Setting to NULL deletes instance (RefPtr)
	rx28_ = NULL;
}

/** Update sensor values as necessary.
 * To be called only from PanTiltSensorThread. Writes the current pan/tilt
 * data into the interface.
 */
void
PanTiltRX28Thread::update_sensor_values()
{
	if (wt_->has_fresh_data()) {
		float        pan = 0, tilt = 0, panvel = 0, tiltvel = 0;
		fawkes::Time time;
		wt_->get_pantilt(pan, tilt, time);
		wt_->get_velocities(panvel, tiltvel);

		// poor man's filter: only update if we get a change of least half a degree
		if (fabs(last_pan_ - pan) >= 0.009 || fabs(last_tilt_ - tilt) >= 0.009) {
			last_pan_  = pan;
			last_tilt_ = tilt;
		} else {
			pan  = last_pan_;
			tilt = last_tilt_;
		}

		pantilt_if_->set_pan(pan);
		pantilt_if_->set_tilt(tilt);
		pantilt_if_->set_pan_velocity(panvel);
		pantilt_if_->set_tilt_velocity(tiltvel);
		pantilt_if_->set_enabled(wt_->is_enabled());
		pantilt_if_->set_final(wt_->is_final());
		pantilt_if_->write();

		panjoint_if_->set_position(pan);
		panjoint_if_->set_velocity(panvel);
		panjoint_if_->write();

		tiltjoint_if_->set_position(tilt);
		tiltjoint_if_->set_velocity(tiltvel);
		tiltjoint_if_->write();

#ifdef HAVE_TF
		if (cfg_publish_transforms_) {
			// Always publish updated transforms
			tf::Quaternion pr;
			pr.setEulerZYX(pan, 0, 0);
			tf::Transform ptr(pr, translation_pan_);
			tf_publisher->send_transform(ptr, time, cfg_base_frame_, cfg_pan_link_);

			tf::Quaternion tr;
			tr.setEulerZYX(0, tilt, 0);
			tf::Transform ttr(tr, translation_tilt_);
			tf_publisher->send_transform(ttr, time, cfg_pan_link_, cfg_tilt_link_);
		}
#endif
	}
}

void
PanTiltRX28Thread::loop()
{
	pantilt_if_->set_final(wt_->is_final());

	while (!pantilt_if_->msgq_empty()) {
		if (pantilt_if_->msgq_first_is<PanTiltInterface::CalibrateMessage>()) {
			// ignored

		} else if (pantilt_if_->msgq_first_is<PanTiltInterface::GotoMessage>()) {
			PanTiltInterface::GotoMessage *msg = pantilt_if_->msgq_first(msg);

			wt_->goto_pantilt(msg->pan(), msg->tilt());
			pantilt_if_->set_msgid(msg->id());
			pantilt_if_->set_final(false);

		} else if (pantilt_if_->msgq_first_is<PanTiltInterface::TimedGotoMessage>()) {
			PanTiltInterface::TimedGotoMessage *msg = pantilt_if_->msgq_first(msg);

			wt_->goto_pantilt_timed(msg->pan(), msg->tilt(), msg->time_sec());
			pantilt_if_->set_msgid(msg->id());
			pantilt_if_->set_final(false);

		} else if (pantilt_if_->msgq_first_is<PanTiltInterface::ParkMessage>()) {
			PanTiltInterface::ParkMessage *msg = pantilt_if_->msgq_first(msg);

			wt_->goto_pantilt(0, 0);
			pantilt_if_->set_msgid(msg->id());
			pantilt_if_->set_final(false);

		} else if (pantilt_if_->msgq_first_is<PanTiltInterface::SetEnabledMessage>()) {
			PanTiltInterface::SetEnabledMessage *msg = pantilt_if_->msgq_first(msg);

			wt_->set_enabled(msg->is_enabled());

		} else if (pantilt_if_->msgq_first_is<PanTiltInterface::SetVelocityMessage>()) {
			PanTiltInterface::SetVelocityMessage *msg = pantilt_if_->msgq_first(msg);

			if (msg->pan_velocity() > pantilt_if_->max_pan_velocity()) {
				logger->log_warn(name(),
				                 "Desired pan velocity %f too high, max is %f",
				                 msg->pan_velocity(),
				                 pantilt_if_->max_pan_velocity());
			} else if (msg->tilt_velocity() > pantilt_if_->max_tilt_velocity()) {
				logger->log_warn(name(),
				                 "Desired tilt velocity %f too high, max is %f",
				                 msg->tilt_velocity(),
				                 pantilt_if_->max_tilt_velocity());
			} else {
				wt_->set_velocities(msg->pan_velocity(), msg->tilt_velocity());
			}

		} else if (pantilt_if_->msgq_first_is<PanTiltInterface::SetMarginMessage>()) {
			PanTiltInterface::SetMarginMessage *msg = pantilt_if_->msgq_first(msg);

			wt_->set_margins(msg->pan_margin(), msg->tilt_margin());
			pantilt_if_->set_pan_margin(msg->pan_margin());
			pantilt_if_->set_tilt_margin(msg->tilt_margin());

		} else {
			logger->log_warn(name(), "Unknown message received");
		}

		pantilt_if_->msgq_pop();
	}

	pantilt_if_->write();

	bool write_led_if = false;
	while (!led_if_->msgq_empty()) {
		write_led_if = true;
		if (led_if_->msgq_first_is<LedInterface::SetIntensityMessage>()) {
			LedInterface::SetIntensityMessage *msg = led_if_->msgq_first(msg);
			wt_->set_led_enabled((msg->intensity() >= 0.5));
			led_if_->set_intensity((msg->intensity() >= 0.5) ? LedInterface::ON : LedInterface::OFF);
		} else if (led_if_->msgq_first_is<LedInterface::TurnOnMessage>()) {
			wt_->set_led_enabled(true);
			led_if_->set_intensity(LedInterface::ON);
		} else if (led_if_->msgq_first_is<LedInterface::TurnOffMessage>()) {
			wt_->set_led_enabled(false);
			led_if_->set_intensity(LedInterface::OFF);
		}

		led_if_->msgq_pop();
	}
	if (write_led_if)
		led_if_->write();

	//wt_->wakeup();
}

bool
PanTiltRX28Thread::bb_interface_message_received(Interface *interface, Message *message) noexcept
{
	if (message->is_of_type<PanTiltInterface::StopMessage>()) {
		wt_->stop_motion();
		return false; // do not enqueue StopMessage
	} else if (message->is_of_type<PanTiltInterface::FlushMessage>()) {
		wt_->stop_motion();
		logger->log_info(name(), "Flushing message queue");
		pantilt_if_->msgq_flush();
		return false;
	} else {
		logger->log_info(name(), "Received message of type %s, enqueueing", message->type());
		return true;
	}
}

/** @class PanTiltRX28Thread::WorkerThread "robotis/rx28_thread.h"
 * Worker thread for the PanTiltRX28Thread.
 * This continuous thread issues commands to the RX28 chain. In each loop it
 * will first execute pending operations, and then update the sensor data (lengthy
 * operation). Sensor data will only be updated while either a servo in the chain
 * is still moving or torque is disabled (so the motor can be move manually).
 * @author Tim Niemueller
 */

/** Constructor.
 * @param ptu_name name of the pan/tilt unit
 * @param logger logger
 * @param rx28 RX28 chain
 * @param pan_servo_id servo ID of the pan servo
 * @param tilt_servo_id servo ID of the tilt servo
 * @param pan_min minimum pan in rad
 * @param pan_max maximum pan in rad
 * @param tilt_min minimum tilt in rad
 * @param tilt_max maximum tilt in rad
 * @param pan_offset pan offset from zero in servo ticks
 * @param tilt_offset tilt offset from zero in servo ticks
 */
PanTiltRX28Thread::WorkerThread::WorkerThread(std::string                 ptu_name,
                                              fawkes::Logger *            logger,
                                              fawkes::RefPtr<RobotisRX28> rx28,
                                              unsigned char               pan_servo_id,
                                              unsigned char               tilt_servo_id,
                                              float &                     pan_min,
                                              float &                     pan_max,
                                              float &                     tilt_min,
                                              float &                     tilt_max,
                                              float &                     pan_offset,
                                              float &                     tilt_offset)
: Thread("", Thread::OPMODE_WAITFORWAKEUP)
{
	set_name("RX28WorkerThread(%s)", ptu_name.c_str());
	set_coalesce_wakeups(true);

	logger_ = logger;

