fawkesrobotics/fawkes/src/plugins/pantilt/robotis/rx28_thread.cpp
	value_rwlock_     = new ReadWriteLock();
	rx28_rwlock_      = new ReadWriteLock();
	fresh_data_mutex_ = new Mutex();
	update_waitcond_  = new WaitCondition();

	rx28_          = rx28;
	move_pending_  = false;
	target_pan_    = 0;
	target_tilt_   = 0;
	pan_servo_id_  = pan_servo_id;
	tilt_servo_id_ = tilt_servo_id;

	pan_min_     = pan_min;
	pan_max_     = pan_max;
	tilt_min_    = tilt_min;
	tilt_max_    = tilt_max;
	pan_offset_  = pan_offset;
	tilt_offset_ = tilt_offset;
	enable_      = false;
	disable_     = false;
	led_enable_  = false;
	led_disable_ = false;

	max_pan_speed_  = rx28_->get_max_supported_speed(pan_servo_id_);
	max_tilt_speed_ = rx28_->get_max_supported_speed(tilt_servo_id_);
}

/** Destructor. */
PanTiltRX28Thread::WorkerThread::~WorkerThread()
{
	delete value_rwlock_;
	delete rx28_rwlock_;
	delete fresh_data_mutex_;
	delete update_waitcond_;
}

/** Enable or disable servo.
 * @param enabled true to enable servos, false to turn them off
 */
void
PanTiltRX28Thread::WorkerThread::set_enabled(bool enabled)
{
	ScopedRWLock lock(value_rwlock_);
	if (enabled) {
		enable_  = true;
		disable_ = false;
	} else {
		enable_  = false;
		disable_ = true;
	}
	wakeup();
}

/** Enable or disable LED.
 * @param enabled true to enable LED, false to turn it off
 */
void
PanTiltRX28Thread::WorkerThread::set_led_enabled(bool enabled)
{
	ScopedRWLock lock(value_rwlock_);
	if (enabled) {
		led_enable_  = true;
		led_disable_ = false;
	} else {
		led_enable_  = false;
		led_disable_ = true;
	}
	wakeup();
}

/** Stop currently running motion. */
void
PanTiltRX28Thread::WorkerThread::stop_motion()
{
	float pan = 0, tilt = 0;
	get_pantilt(pan, tilt);
	goto_pantilt(pan, tilt);
}

/** Goto desired pan/tilt values.
 * @param pan pan in radians
 * @param tilt tilt in radians
 */
void
PanTiltRX28Thread::WorkerThread::goto_pantilt(float pan, float tilt)
{
	ScopedRWLock lock(value_rwlock_);
	target_pan_   = pan;
	target_tilt_  = tilt;
	move_pending_ = true;
	wakeup();
}

/** Goto desired pan/tilt values in a specified time.
 * @param pan pan in radians
 * @param tilt tilt in radians
 * @param time_sec time when to reach the desired pan/tilt values
 */
void
PanTiltRX28Thread::WorkerThread::goto_pantilt_timed(float pan, float tilt, float time_sec)
{
	target_pan_   = pan;
	target_tilt_  = tilt;
	move_pending_ = true;

	float cpan = 0, ctilt = 0;
	get_pantilt(cpan, ctilt);

	float pan_diff  = fabs(pan - cpan);
	float tilt_diff = fabs(tilt - ctilt);

	float req_pan_vel  = pan_diff / time_sec;
	float req_tilt_vel = tilt_diff / time_sec;

	//logger_->log_debug(name(), "Current: %f/%f Des: %f/%f  Time: %f  Diff: %f/%f  ReqVel: %f/%f",
	//		      cpan, ctilt, pan, tilt, time_sec, pan_diff, tilt_diff, req_pan_vel, req_tilt_vel);

	if (req_pan_vel > max_pan_speed_) {
		logger_->log_warn(name(),
		                  "Requested move to (%f, %f) in %f sec requires a "
		                  "pan speed of %f rad/s, which is greater than the maximum "
		                  "of %f rad/s, reducing to max",
		                  pan,
		                  tilt,
		                  time_sec,
		                  req_pan_vel,
		                  max_pan_speed_);
		req_pan_vel = max_pan_speed_;
	}

	if (req_tilt_vel > max_tilt_speed_) {
		logger_->log_warn(name(),
		                  "Requested move to (%f, %f) in %f sec requires a "
		                  "tilt speed of %f rad/s, which is greater than the maximum of "
		                  "%f rad/s, reducing to max",
		                  pan,
		                  tilt,
		                  time_sec,
		                  req_tilt_vel,
		                  max_tilt_speed_);
		req_tilt_vel = max_tilt_speed_;
	}

	set_velocities(req_pan_vel, req_tilt_vel);

	wakeup();
}

/** Set desired velocities.
 * @param pan_vel pan velocity
 * @param tilt_vel tilt velocity
 */
void
PanTiltRX28Thread::WorkerThread::set_velocities(float pan_vel, float tilt_vel)
{
	ScopedRWLock lock(value_rwlock_);
	float        pan_tmp  = roundf((pan_vel / max_pan_speed_) * RobotisRX28::MAX_SPEED);
	float        tilt_tmp = roundf((tilt_vel / max_tilt_speed_) * RobotisRX28::MAX_SPEED);

	//logger_->log_debug(name(), "old speed: %u/%u new speed: %f/%f", pan_vel_,
	//		      tilt_vel_, pan_tmp, tilt_tmp);

	if ((pan_tmp >= 0) && (pan_tmp <= RobotisRX28::MAX_SPEED)) {
		pan_vel_      = (unsigned int)pan_tmp;
		velo_pending_ = true;
	} else {
		logger_->log_warn(name(),
		                  "Calculated pan value out of bounds, min: 0  max: %u  des: %u",
		                  RobotisRX28::MAX_SPEED,
		                  (unsigned int)pan_tmp);
	}

	if ((tilt_tmp >= 0) && (tilt_tmp <= RobotisRX28::MAX_SPEED)) {
		tilt_vel_     = (unsigned int)tilt_tmp;
		velo_pending_ = true;
	} else {
		logger_->log_warn(name(),
		                  "Calculated tilt value out of bounds, min: 0  max: %u  des: %u",
		                  RobotisRX28::MAX_SPEED,
		                  (unsigned int)tilt_tmp);
	}
}

/** Get current velocities.
 * @param pan_vel upon return contains current pan velocity
 * @param tilt_vel upon return contains current tilt velocity
 */
void
PanTiltRX28Thread::WorkerThread::get_velocities(float &pan_vel, float &tilt_vel)
{
	unsigned int pan_velticks  = rx28_->get_goal_speed(pan_servo_id_);
	unsigned int tilt_velticks = rx28_->get_goal_speed(tilt_servo_id_);

	pan_velticks =
	  (unsigned int)(((float)pan_velticks / (float)RobotisRX28::MAX_SPEED) * max_pan_speed_);
	tilt_velticks =
	  (unsigned int)(((float)tilt_velticks / (float)RobotisRX28::MAX_SPEED) * max_tilt_speed_);
}

/** Set desired velocities.
 * @param pan_margin pan margin
 * @param tilt_margin tilt margin
 */
void
PanTiltRX28Thread::WorkerThread::set_margins(float pan_margin, float tilt_margin)
{
	if (pan_margin > 0.0)
		pan_margin_ = pan_margin;
	if (tilt_margin > 0.0)
		tilt_margin_ = tilt_margin;
	//logger_->log_warn(name(), "Margins set to %f, %f", pan_margin_, tilt_margin_);
}

/** Get pan/tilt value.
 * @param pan upon return contains the current pan value
 * @param tilt upon return contains the current tilt value
 */
void
PanTiltRX28Thread::WorkerThread::get_pantilt(float &pan, float &tilt)
{
	ScopedRWLock lock(rx28_rwlock_, ScopedRWLock::LOCK_READ);

