fawkesrobotics/fawkes/src/plugins/pantilt/robotis/rx28_thread.cpp
	int pan_ticks  = ((int)rx28_->get_position(pan_servo_id_) - (int)RobotisRX28::CENTER_POSITION);
	int tilt_ticks = ((int)rx28_->get_position(tilt_servo_id_) - (int)RobotisRX28::CENTER_POSITION);

	pan  = pan_ticks * RobotisRX28::RAD_PER_POS_TICK + pan_offset_;
	tilt = tilt_ticks * RobotisRX28::RAD_PER_POS_TICK + tilt_offset_;
}

/** Get pan/tilt value with time.
 * @param pan upon return contains the current pan value
 * @param tilt upon return contains the current tilt value
 * @param time upon return contains the time the pan and tilt values were read
 */
void
PanTiltRX28Thread::WorkerThread::get_pantilt(float &pan, float &tilt, fawkes::Time &time)
{
	get_pantilt(pan, tilt);
	time = pantilt_time_;
}

/** Check if motion is final.
 * @return true if motion is final, false otherwise
 */
bool
PanTiltRX28Thread::WorkerThread::is_final()
{
	float pan, tilt;
	get_pantilt(pan, tilt);

	/*
  logger_->log_debug(name(), "P: %f  T: %f  TP: %f  TT: %f  PM: %f  TM: %f  PMov: %i  TMov: %i  Final: %s",
                      pan, tilt, target_pan_, target_tilt_, pan_margin_, tilt_margin_,
                      rx28_->is_moving(pan_servo_id_), rx28_->is_moving(tilt_servo_id_),
                      (( (fabs(pan  - target_pan_)  <= pan_margin_) &&
                         (fabs(tilt - target_tilt_) <= tilt_margin_) ) ||
                       (! rx28_->is_moving(pan_servo_id_) &&
                        ! rx28_->is_moving(tilt_servo_id_))) ? "YES" : "NO");
  */

	ScopedRWLock lock(rx28_rwlock_, ScopedRWLock::LOCK_READ);

	return ((fabs(pan - target_pan_) <= pan_margin_) && (fabs(tilt - target_tilt_) <= tilt_margin_))
	       || (!rx28_->is_moving(pan_servo_id_) && !rx28_->is_moving(tilt_servo_id_));
}

/** Check if PTU is enabled.
 * @return true if torque is enabled for both servos, false otherwise
 */
bool
PanTiltRX28Thread::WorkerThread::is_enabled()
{
	return (rx28_->is_torque_enabled(pan_servo_id_) && rx28_->is_torque_enabled(tilt_servo_id_));
}

/** Check is fresh sensor data is available.
 * Note that this method will return true at once per sensor update cycle.
 * @return true if fresh data is available, false otherwise
 */
bool
PanTiltRX28Thread::WorkerThread::has_fresh_data()
{
	MutexLocker lock(fresh_data_mutex_);

	bool rv     = fresh_data_;
	fresh_data_ = false;
	return rv;
}

void
PanTiltRX28Thread::WorkerThread::loop()
{
	if (enable_) {
		value_rwlock_->lock_for_write();
		enable_ = false;
		value_rwlock_->unlock();
		ScopedRWLock lock(rx28_rwlock_);
		rx28_->set_led_enabled(tilt_servo_id_, true);
		rx28_->set_torques_enabled(true, 2, pan_servo_id_, tilt_servo_id_);
	} else if (disable_) {
		value_rwlock_->lock_for_write();
		disable_ = false;
		value_rwlock_->unlock();
		ScopedRWLock lock(rx28_rwlock_);
		if (led_enable_ || led_disable_ || velo_pending_ || move_pending_)
			usleep(3000);
	}

	if (led_enable_) {
		value_rwlock_->lock_for_write();
		led_enable_ = false;
		value_rwlock_->unlock();
		ScopedRWLock lock(rx28_rwlock_);
		rx28_->set_led_enabled(pan_servo_id_, true);
		if (velo_pending_ || move_pending_)
			usleep(3000);
	} else if (led_disable_) {
		value_rwlock_->lock_for_write();
		led_disable_ = false;
		value_rwlock_->unlock();
		ScopedRWLock lock(rx28_rwlock_);
		rx28_->set_led_enabled(pan_servo_id_, false);
		if (velo_pending_ || move_pending_)
			usleep(3000);
	}

	if (velo_pending_) {
		value_rwlock_->lock_for_write();
		velo_pending_         = false;
		unsigned int pan_vel  = pan_vel_;
		unsigned int tilt_vel = tilt_vel_;
		value_rwlock_->unlock();
		ScopedRWLock lock(rx28_rwlock_);
		rx28_->set_goal_speeds(2, pan_servo_id_, pan_vel, tilt_servo_id_, tilt_vel);
		if (move_pending_)
			usleep(3000);
	}

	if (move_pending_) {
		value_rwlock_->lock_for_write();
		move_pending_     = false;
		float target_pan  = target_pan_;
		float target_tilt = target_tilt_;
		value_rwlock_->unlock();
		exec_goto_pantilt(target_pan, target_tilt);
	}

	try {
		ScopedRWLock lock(rx28_rwlock_, ScopedRWLock::LOCK_READ);
		rx28_->read_table_values(pan_servo_id_);
		rx28_->read_table_values(tilt_servo_id_);
		{
			MutexLocker lock_fresh_data(fresh_data_mutex_);
			fresh_data_ = true;
			pantilt_time_.stamp();
		}
	} catch (Exception &e) {
		// usually just a timeout, too noisy
		//logger_->log_warn(name(), "Error while reading table values from servos, exception follows");
		//logger_->log_warn(name(), e);
	}

	//if (! is_final() ||
	//    ! rx28_->is_torque_enabled(pan_servo_id_) ||
	//    ! rx28_->is_torque_enabled(tilt_servo_id_)) {
	// while moving, and while the motor is off, wake us up to get new servo
	// position data
	//wakeup();
	//}

	update_waitcond_->wake_all();

	// Wakeup ourselves for faster updates
	wakeup();
}

/** Execute pan/tilt motion.
 * @param pan_rad pan in rad to move to
 * @param tilt_rad tilt in rad to move to
 */
void
PanTiltRX28Thread::WorkerThread::exec_goto_pantilt(float pan_rad, float tilt_rad)
{
	if ((pan_rad < pan_min_) || (pan_rad > pan_max_)) {
		logger_->log_warn(
		  name(), "Pan value out of bounds, min: %f  max: %f  des: %f", pan_min_, pan_max_, pan_rad);
		return;
	}
	if ((tilt_rad < tilt_min_) || (tilt_rad > tilt_max_)) {
		logger_->log_warn(name(),
		                  "Tilt value out of bounds, min: %f  max: %f  des: %f",
		                  tilt_min_,
		                  tilt_max_,
		                  tilt_rad);
		return;
	}

	unsigned int pan_min = 0, pan_max = 0, tilt_min = 0, tilt_max = 0;

	rx28_->get_angle_limits(pan_servo_id_, pan_min, pan_max);
	rx28_->get_angle_limits(tilt_servo_id_, tilt_min, tilt_max);

	int pan_pos = (int)roundf(RobotisRX28::POS_TICKS_PER_RAD * (pan_rad - pan_offset_))
	              + RobotisRX28::CENTER_POSITION;
	int tilt_pos = (int)roundf(RobotisRX28::POS_TICKS_PER_RAD * (tilt_rad - tilt_offset_))
	               + RobotisRX28::CENTER_POSITION;

	if ((pan_pos < 0) || ((unsigned int)pan_pos < pan_min) || ((unsigned int)pan_pos > pan_max)) {
		logger_->log_warn(
		  name(), "Pan position out of bounds, min: %u  max: %u  des: %i", pan_min, pan_max, pan_pos);
		return;
	}

	if ((tilt_pos < 0) || ((unsigned int)tilt_pos < tilt_min)
	    || ((unsigned int)tilt_pos > tilt_max)) {
		logger_->log_warn(name(),
		                  "Tilt position out of bounds, min: %u  max: %u  des: %i",
		                  tilt_min,
		                  tilt_max,
		                  tilt_pos);
		return;
	}

	ScopedRWLock lock(rx28_rwlock_);
	rx28_->goto_positions(2, pan_servo_id_, pan_pos, tilt_servo_id_, tilt_pos);
}

/** Wait for fresh data to be received.
 * Blocks the calling thread.
 */
void
PanTiltRX28Thread::WorkerThread::wait_for_fresh_data()
{
	update_waitcond_->wait();
}
